{
  "ru-RU": {
    "ISO_CODE": "ru-RU",
    "CARD_ABOUT": "О сайте",
    "CARD_DONATE": "Донаты",
    "CARD_ME_FIRST_NAME": "Виктор",
    "CARD_ME_LAST_NAME": "Щелочков",
    "CARD_ME_SPECIALIZATION": "Веб-разработчик",
    "FULL_SPECIALIZATION": "Разработчик веб-приложений",
    "CARD_ME_CITY": "Самара",
    "CARD_PORTFOLIO": [
      "проект",
      "проекта",
      "проектов"
    ],
    "CARD_PORTFOLIO_IN_PORTFOLIO": "в портфолио",
    "CARD_SERVICES": "Услуги",
    "THEME_SWITCH_TO_LIGHT": "Включить светлую тему",
    "THEME_SWITCH_TO_DARK": "Включить темную тему",
    "CHANGE_LANGUAGE": "Сменить язык",
    "LANGUAGE_RUSSIAN": "Русский язык",
    "LANGUAGE_ENGLISH": "Английский язык",
    "BACK": "Вернуться назад в главное меню",
    "PAGES_TITLES": {
      "me": "Обо мне",
      "portfolio": "Портфолио",
      "services": "Услуги",
      "donate": "Донаты",
      "about": "О сайте"
    },
    "SERVICES_CARDS": {
      "landing": {
        "title": "Разработка лендинга",
        "description": "Поднимите продажи продукта и расскажите о нем максимально просто и ясно с помощью лендинга — одностраничного сайта с запоминающимся контентом и интерактивными элементами",
        "price": "С макетом — от 10 000 ₽, без макета — от 15 000 ₽"
      },
      "turnkey_website": {
        "title": "Разработка сайта «под ключ»",
        "description": "Блог с базой данных MongoDB или SQL, СМИ, интернет-магазин с приемом оплаты и админ-панелью — верстка сайта, разработка бекенда, настройка сервера и баз данных входит в единую услугу",
        "price": "От 25 000 ₽"
      },
      "bot": {
        "title": "Разработка бота",
        "description": "Увеличьте конверсии, предоставьте пользователям обратную связь и продвигайте сообщества и каналы проверкой на подписку с ботом ВКонтакте, Telegram (Bot API и MTProto), WhatsApp или Viber,продвигайте свой продукт с ботом Discord, навыком Яндекс.Алиса, приложением Reddit или ботом, работающим с другими API",
        "price": "От 5 000 ₽"
      },
      "other": {
        "title": "Разработка уникального инструмента",
        "description": "Разработка расширений для браузеров, разработка Minecraft-сервера, настройка почтового сервера и рассылок, вспомогательные плагины для Figma и другое",
        "price": "Договорная цена"
      }
    },
    "ABOUT_ME": {
      "HEADING": "Привет, меня зовут Виктор, и я специалист в области разработки веб-приложений",
      "INTRO": "Я профессионально занимаюсь разработкой приложений PWA и инструментов для крупных клиентов более двух лет,\nа общий опыт разработки сайтов у меня более 5 лет. Мой основной стек для фронтенда: <b>React, Next.js, React Native, Preact и Vite</b>.\nВ мои обязанности входит мобильный, кросс-браузерный и семантический адаптив, чтобы сайт смотрелся одинаково хорошо\nна всех устройствах и во всех браузерах.",
      "INTRO_IMAGE": "Стикер белой собаки Спотти ВКонакте с жестом Лайк",
      "BACKEND": "Помимо фронтенда я занимаюсь и бекендом, для своих клиентов создаю сайты «под ключ», настраивая сервер, почту и создавая сам сайт с нуля по желанию заказчика,\nпомогая реализовать сайт с учетом конкретных технических требований и по макету Figma/Photoshop/Illustrator, или работая в команде с другими разработчиками.",
      "MY_PROJECTS": "В своих проектах я чаще всего использую веб-серверы <b>Express и Fastify с Nginx</b> (ранее 3 года работал с Apache), базы данных\n<b>MongoDB, Redis и LevelDB</b>, подбирая подходящую базу данных с учетом размера проекта (ранее работал с MySQL и PostgreSQL)",
      "MY_PROJECTS_IMAGE": "Колобанга с жестом Коза",
      "BOTS": "Более четырех лет я разрабатываю <b>ботов для ВКонтакте, Телеграма, Дискорда, Реддита, Яндекс.Алисы</b>, расширения для\nбраузеров, плагины для Figma, инструменты для разработчиков, такие как библиотеки и другие полезные инструменты.\nСейчас я учу Kubernetes, знаю <b>Docker</b> и по вашему желанию создать образ/контейнер вместо архива с проектом, для\nбыстрого масштабирования и развертки между серверами.",
      "PARSING": "Также в последнее время я разработал несколько врапперов API, а с апреля 2022 года изучаю Golang и работу с оперативной памятью, также я работал со скрин-скрейпингом и парсингом данных: я создал уже несколько\nбиблиотек JS для работы с закрытым API некоторых сайтов, причем они включают в себя как работу с голым HTML, так и\nработу напрямую с SignalR.",
      "PARSING_IMAGE": "Шрек смотрит налево (направо относительно него)",
      "WORK_EXPERIENCE_LABEL": "Опыт работы",
      "WORK_EXPERIENCE_BLOCK": "<ul>\n  <li>Разработал несколько сайтов для российского блоггера-стримера, сайты (Президент Абоба, Гадзы Глада Валакаса) сейчас имеют сотни уникальных посетителей в месяц</li>\n  <li>Разработал плагин Figma для быстрой верстки кросс-платформерных макетов для Joom</li>\n  <li>Работал в команде над онлайн-школой английского языка на Electron.js</li>\n  <li>Разработал несколько проектов на Tauri, чтобы создать нативное кросс-платформенное приложение</li>\n  <li>Разработал бота с панелью управления, установкой на сервер для канала AtmosSeries в телеграме, который имеет\n      охват в десятки тысяч пользователей, затем мы продолжили работать и совместно создали сервер для игры\n      Minecraft с сайтом с оплатой для него</li>\n  <li>Работал в команде Национального Центра Исследований в Казахстане, работающая над CRM для сотрудников центра</li>\n</ul>",
      "ENDING": "Более подробную информацию о моих навыках вы можете найти в портфолио и в моем <a href='https://github.com/VityaSchel'>аккаунте GitHub</a>, который я веду\nс 2019 года, создаю полезные библиотеки и стремлюсь улучшать DX.\nЕсли у вас еще остались вопросы или вы готовы обсудить проект со мной — пишите мне в Телеграм: <a href='tg://resolve?domain=hlothdev'>@hlothdev</a> или в другие соц. сети, перечисленные на этой странице.",
      "ENDING_IMAGE": "UWU эмодзи",
      "CATEGORIES": {
        "frontend": "Фронтенд",
        "backend": "Бекенд",
        "apps": "Приложения",
        "bot": "Разработка ботов",
        "gamedev": "Разработка игр",
        "design": "Дизайн",
        "mobile": "Мобайл"
      },
      "STARTED_LEARNING": "Учу с",
      "OPEN_PROJECTS_CAPTION": "Смотреть проекты",
      "WHAT_IS_HLOTH": {
        "HEADING": "Как переводится \"hloth\"?",
        "TEXT": "hloth (на рус. хлоз, читается как [h l ó θ]) — этот никнейм я придумал в ноябре 2021 года, когда создавал профиль фрилансера. Этот никнейм не случайный набор букв, потому что у меня было 5 критериев:",
        "CRITERIA": [
          "от 5 до 7 букв",
          "связано с программированием или не связано с другими тематиками",
          "не является существующим словом и не похоже на негативные слова",
          "читается в 1 или 2 слога",
          "(необязательно) похоже на витя"
        ],
        "TEXT2": "А также обязательно должен был быть доступен домен с таким именем в зоне .dev или в зоне, заканчивающей домен. В древнегреческой мифологии, бог Хаос — это бессмертный бог порождений, что уже одним названием указывает на то, что мое творчество не имеет границ и будет существовать, пока жив сам мир. Конечно, это шутка, а этот текст нужен для заполнения пространства слева, чтобы вы могли увидеть используемые мной технологии справа и проводили на сайте больше времени для повышения SEO. Никнейм я придумал случайно, подбирая простые окончания к \"хл\". Мои друзья предлагали мне и другие варианты:",
        "VARIANTS": [
          "vítěz — символы вне группы таблицы ASCII нежелательно использовать в домене, тем более мне нужно было напечатать его на продукции в реальной жизни, а не каждый пользователь и потенциальный заказчик сообразит, как ввести буквы из чешского алфавита",
          "megakiller",
          "pykov — предложил искуственный интеллект, генерирующий имя для бизнеса",
          "weetapp",
          "vitezhorny",
          "viapp — идея была в том, что vi читается как we (мы/наше)",
          "vitsch — сокращение от vityaschel, которое тоже явяляется сокращением",
          "devitya — было уже занято"
        ],
        "TEXT3": "Все эти варианты даже не рассматривались, когда я придумал hloth."
      },
      "ABOUT_ME_AS_PERSON": {
        "HEADING": "Обо мне (как о человеке)",
        "INTRO": "Однажды я услышал, как мудрый человек сказал: «в хорошем резюме должно быть четыре страницы: 1. Опыт работы, 2. Образовние, 3. Скиллы, 4. Немного о Вас». Итак, вы добрались до четвертой страницы моего резюме (в виде сайта), и сейчас я хотел бы рассказать немного о себе как о человеке.",
        "TEXT": "Я серьезный человек, но только пока меня кто-нибудь не рассмешит. Моя жизненная цель — выбраться из России в Чехию, выучив Чешский язык, но пока я знаю только Ahoj! Jmenuji Vitez Alkalie. Čau! Я уже привык к тому, что неоплачиваемые работники в команде уходят через 7 дней. Я слушаю мешапы и видео на ютубе вместо музыки. Мечтаю научиться играть на фортепиано и гитаре, чтобы не платить композиторам для создания музыки к моим играм. Сломал макбук через 2 месяца после покупки и с марта 2021 года работаю на ноутбуке через внешний монитор; когда-нибудь я обязательно накоплю деньги на ремонт и смогу как настоящий программист ходить с ним в старбакс."
      }
    },
    "PORTFOLIO": {
      "COLUMNS": {
        "NAME": "Название",
        "DESCRIPTION": "Описание",
        "TECHNOLOGIES": "Технологии",
        "DATES": {
          "DEVSTART": "Начало разработки",
          "RELEASE": "Релиз",
          "ABANDON": "Приостановка"
        }
      },
      "SEARCH": {
        "PLACEHOLDER": "Поиск по портфолио: название, описание, технологии",
        "EXAMPLE": "Например, «Лендинг» или «Redux, React Native»",
        "CLEAR": "Очистить"
      },
      "CATEGORIES": {
        "game/windows10": "Игра Windows 10",
        "game/android": "Игра Android",
        "website": "Веб-сайт",
        "bot/reddit": "Бот Reddit",
        "figma_plugin": "Плагин Figma",
        "bot/telegram": "Бот Telegram",
        "npmjs_library": "Библиотека js",
        "app": "Приложение",
        "bot/vk": "Бот ВКонтакте",
        "website/darknet": "Веб-сайт Tor Hidden Services",
        "bot/yandex_alice": "Бот Алисы",
        "chrome_extension": "Расширение Chrome",
        "stream": "Стрим",
        "programming_language": "Компилятор языка",
        "minecraft_map": "Minecraft карта",
        "instagram_mask": "Instagram-маска",
        "developer_tool": "Инструмент для разработчиков"
      },
      "FILTERS": {
        "ORDERS_ONLY": "Только заказы",
        "PERSONAL_WEBSITES_ONLY": "Только мои персональные сайты",
        "RECENT_PROJECTS_ONLY": "Только проекты за последние 12 месяцев"
      },
      "HIDDEN_PROJECT": {
        "NAME": "Скрытый проект",
        "DESCRIPTION_PREVIEW": "Нажмите, чтобы узнать подробнее",
        "DESCRIPTION": "Информация об этом проекте скрыта, потому что её разглашение противоречит моим принципам о сохранении конфиденциальности или может дискредитировать меня. Если этот проект вас заинтересовал, я готов рассказать о нем лично, для этого назовите его номер: %PROJECT_ID%."
      },
      "SHOCK_PROJECT": {
        "NAME": "Нежелательный контент",
        "DESCRIPTION_PREVIEW": "Нажмите, чтобы показать информацию о проекте",
        "DESCRIPTION": "Указанный контент может показаться некоторым людям оскорбительным и шокирующим, однако он имеет достаточно ценное значение для моего портфолио, чтобы оставить его здесь. Если вы хотите увидеть информацию об этом и других проектах из этой категории, нажмете кнопку Показать ниже."
      },
      "PROJECT_DIALOG": {
        "LINKS_LABEL": "Ссылки",
        "SHARE_LABEL": "Поделиться",
        "CLOSE_LABEL": "Закрыть",
        "LINK_COPIED": "Ссылка скопирована",
        "SHOW_SHOCKING_PROJECTS": "Показать"
      }
    },
    "ABOUT_THIS_WEBSITE": {
      "HEADING": "Сайт hloth.dev",
      "TEXT": "Это мой шестой по-счету персональный сайт. Он содержит информацию обо мне, моих проектах, является неким портфолио и резюме одновременно, и даже служит инструментом для пожертвований мне. Если вам все еще интересно, почему опубликовав игру в Steam и получая заказы со фриланса, я имею совесть просить донаты, то во-первых, я разработчик open-source приложений, инструментов для разработчиков и просто полезных программ, веселых сайтов (без рекламы!) и мобильных игр без доната, а во-вторых позвольте привести мне немного статистики по моей прибыли со всех моих продуктов (за исключением Stigfinnare, потому что это запрещено NDA от Steam Direct): ровно 0 долларов, что в рублях, в текущем курсе, 0 рублей. На моих сайтах нет рекламы, я не встраиваю платные подписки, деньги я получаю только с донатов друзей, привет Ваня Севрюков. С донатов за 2021 год я получил меньше 1000 рублей, а в случае Stigfinnare, так как я не могу разглашать никакую информацию о заработке, я просто оставлю намек: фактически нисколько, а если считать с затратами на разработку, то я ушел в минус на 20к. Немного информации о моих предыдущих сайтах:",
      "PREVIOUS_SITES": [
        "Сайт на конструкторе uCoz (2015-2016) — Мой первый сайт, на котором были игры, тесты и другие штучки, чем-то вдохновлён легендарным сайтом девочки Дианочки http://devo4ka-diano4ka.narod.ru/",
        "Сайт на hostinger (2018-2019) — Сайт на котором я учился на практике вебу: я создавал страницы, смотрел как работает html и даже смог установить свою первую капчу с проверкой",
        "Карта проектов (первая четверть 2020) — Сайт на котором была карта с проектами, всего было несколько пузырьков, а связь между ними обозначалась линиями, если навести курсор, то появлялось описание. Сделано на написанном мною движке на JavaScript",
        "Галерея проектов (вторая четверть 2020) — Сразу после того, как я выучил теорию по JS, я переделал свой сайт, он уже выглядел более современно, имел приятную палитру цветов, информацию обо мне и мое портфолио (только самые главные проекты), а также имел адекватную мобильную версию",
        "Лендинг с космическим дизайном (четвертая четверть 2020) — Сайт с анимациями, параллаксом, шейдером для градиентов в JavaScript и OpenGL, формой для связи, связанной с телеграм-ботом, который связан с SMTP-сервером для обратной связи. К сожалению, был закрыт через месяц из-за сложностей с созданием мобильной версии и лагами, потому что сайт был сделан на ванильном js, всего за пару месяцев до того, как я выучил React"
      ],
      "VISITORS_THIS_MONTH": "Посетителей за этот месяц",
      "LINKS": {
        "INSTAGRAM_HIGHLIGHTS": "Больше скриншотов в \"Актуальном\"",
        "GITHUB_SOURCES": "Исходники сайта на GitHub"
      }
    }
  },
  "_DEFAULT_": {
    "ISO_CODE": "en-US",
    "CARD_ABOUT": "About",
    "CARD_DONATE": "Donate",
    "CARD_ME_FIRST_NAME": "Viktor",
    "CARD_ME_LAST_NAME": "Shchelochkov",
    "CARD_ME_SPECIALIZATION": "Web-developer",
    "FULL_SPECIALIZATION": "Web-apps developer",
    "CARD_ME_CITY": "Samara",
    "CARD_PORTFOLIO": "Projects",
    "CARD_PORTFOLIO_IN_PORTFOLIO": "in portfolio",
    "CARD_SERVICES": "Services",
    "THEME_SWITCH_TO_LIGHT": "Switch to light theme",
    "THEME_SWITCH_TO_DARK": "Switch to dark theme",
    "CHANGE_LANGUAGE": "Change language",
    "LANGUAGE_RUSSIAN": "Russian language",
    "LANGUAGE_ENGLISH": "English language",
    "BACK": "Return back to the main menu",
    "PAGES_TITLES": {
      "me": "About me",
      "portfolio": "Portfolio",
      "services": "Services",
      "donate": "Donates",
      "about": "About this web-site"
    },
    "SERVICES_CARDS": {
      "landing": {
        "title": "Landing page",
        "description": "Increase product sales and tell about it as simply and clearly as possible using a landing page - a one-page website with fresh looking design and interactive elements",
        "price": "With your layout — starting form 119 €, if you have no layout — from 179 €"
      },
      "turnkey_website": {
        "title": "Turnkey website",
        "description": "Blog with MongoDB or SQL Database, mass media, online shop with e-commerce/payments and admin panel — frontend+backend development, VPS and Database setup in single service",
        "price": "Starting from 299 €"
      },
      "bot": {
        "title": "Chat-bot or script-bot",
        "description": "Increase conversions, provide users with feedback and promote channels with VKontakte, Telegram (Bot API and MTProto), WhatsApp or Viber bot, promote your product with a Discord bot, Yandex.Alice skill, Reddit app or a bot that works with other APIs",
        "price": "Starting from 59 €"
      },
      "other": {
        "title": "Other",
        "description": "Browsers extensions, Minecraft-server development, mail server and mailings setup, plugins for Figma and other",
        "price": "Let's talk"
      }
    },
    "ABOUT_ME": {
      "HEADING": "Hi, my name is Viktor, and I'm a web-application developer from Russia",
      "INTRO": "I have been professionally developing PWA apps and tools for major clients for over two years, and I have over\nfive years of overall website development experience. My main frontend stack is <b>React, Next.js, React Native,\nPreact, and Vite</b>. My responsibilities include mobile, cross-browser, and semantic responsive development so that\nthe site looks equally good on all devices and in all browsers.",
      "INTRO_IMAGE": "White dog sticker from VKontakte social network",
      "BACKEND": "In addition to the frontend, I also work with backend. For my clients I create turnkey websites, set up the\nhosting, mail server, and develop the site itself from scratch at the request of the customer, helping to\nimplement the site taking into account specific technical requirements and according to the\nFigma/Photoshop/Illustrator layout.",
      "MY_PROJECTS": "In my projects, I mostly use\n<b>Express and Fastify</b> web servers with Nginx reverse proxy or CGI (recently moved from Apache with which I was\nworking for three years), <b>MongoDB, Redis and LevelDB</b> databases, choosing the appropriate database looking at\nthe size of the project (previously I worked with MySQL and PostgreSQL)",
      "MY_PROJECTS_IMAGE": "Yellow Kolobok with sign of the horns gesture",
      "BOTS": "For more than four years I have been developing <b>bots for VKontakte, Telegram, Discord, Reddit, Yandex.Alice</b>,\nbrowser extensions, plugins for Figma, developer tools such as libraries, and other useful instruments. Now I am\nlearning Kubernetes, already have significant experience of working with <b>Docker</b>, and, at your request, I could\ncreate a container instead of a ZIP archive with a project, for quick scaling and deployment between your servers.",
      "PARSING": "Also lately I've started getting into API wrappers, I'm learing Golang since April of 2022 to work with memory on low-level, in past I worked with screen-scraping and data parsing: I've already created several\nJS libraries to work with the closed API of some websites, and they include working with bare HTML, working with\nSignalR directly and other things.",
      "PARSING_IMAGE": "Shrek looking at the left (right relative to him)",
      "WORK_EXPERIENCE_LABEL": "Work Experience",
      "WORK_EXPERIENCE_BLOCK": "<ul>\n  <li>I have developed several websites for the Russian blogger and streamer (President Aboba, Gadzas of \n      Glad Valakas), which now have hundreds of unique visitors per month</li>\n  <li>I have developed Figma plugin for a fast cross-platform layout design for Joom</li>\n  <li>I worked in a team on an online English school with the Electron.js app</li>\n  <li>I have developed several projects on Tauri, to create native cross-platforming app</li>\n  <li>I have developed a bot with an admin control panel, installed on a customer's server for the AtmosSeries\n      channel in Telegram, which has a reach of tens of thousands of users. It allows you to distribute ads in \n      private chat with bot and counts referral registrations</li>\n  <li>Then we continued to work and created a Minecraft server with private survival world and a website with \n      payments processing</li>\n  <li>I worked in the team of the National Research Center in Kazakhstan, we were working on CRM for the \n      center's employees, and my job was to create a custom React component</li>\n</ul>",
      "ENDING": "You can find more information on my skills in my portfolio and on \nmy <a href='https://github.com/VityaSchel'>GitHub account</a>, which I've created\nin 2019, creating libraries used by other web developers and striving to improve DX. If you have any\nquestions or want to discuss your case with me — contact me in\nTelegram: <a href='tg://resolve?domain=hlothdev'>@hlothdev</a> or other ways listed on this page.",
      "ENDING_IMAGE": "UWU emoji",
      "CATEGORIES": {
        "frontend": "Frontend",
        "backend": "Backend",
        "apps": "Apps",
        "bot": "Bot development",
        "gamedev": "Game development",
        "design": "Design",
        "mobile": "Mobile"
      },
      "STARTED_LEARNING": "Learning since",
      "OPEN_PROJECTS_CAPTION": "Open projects",
      "WHAT_IS_HLOTH": {
        "HEADING": "What is \"hloth\"?",
        "TEXT": "hloth (rus. хлоз, read as [h l ó θ]) — is a nickname I came up with in November of 2021, when I was creating freelance profile. This nickname isn't just a set of letters, because I had a list of requirements:",
        "CRITERIA": [
          "from 5 to 7 letters",
          "related to programming or isn't related to anything",
          "is not an existing word and is not similiar to negative words",
          "read in 1 or 2 syllables",
          "(optional) similiar to \"vitya\""
        ],
        "TEXT2": "On top of that, a domain must be available with such a name in the .dev zone or in the zone ending this word. In ancient Greek mythology, the god Chaos is the immortal god of generations, which indicates that my creativity has no boundaries and will exist as long as the world itself is alive. Of course, this is a joke, and this text is needed to fill the space on the left so that you can see the technologies I use on the right and spend more time on the site to improve SEO. Fun fact: while translating this text, I was trying to find god that has closer pronounciation to \"hloth\" and I found \"hoth\", however he was blind and killed his brother, so I stayed on Chaos. I came up with this nickname randomly, while picking up simple endings for \"hl\". My friends offered me some other options:",
        "VARIANTS": [
          "vítěz — characters out of ASCII is not undesirable to use in domain name, besides, I wanted to print domain name on products in real life, and not every average user and potential client knows, how to type Czech alphabet letters",
          "megakiller",
          "pykov — proposed by an AI generating business names (translates as farty from Russian)",
          "weetapp",
          "vitezhorny",
          "viapp — the idea was that vi can be heard as we (our)",
          "vitsch — short for vityaschel, which is also short form of my initials",
          "devitya — was taken already"
        ],
        "TEXT3": "All these options were not even considered, when I came up with hloth."
      },
      "ABOUT_ME_AS_PERSON": {
        "HEADING": "About me (as a person)",
        "INTRO": "I once heard a wise man say: “A good resume should have four pages: 1. Work experience, 2. Education, 3. Skills, 4. A little about you.” So, you have reached the fourth page of my resume (in the form of a website), and now I would like to tell you about myself as a person.",
        "TEXT": "I'm a serious person, but only until someone makes me laugh. My life goal is to get out of Russia to the Czech Republic by learning the Czech language, but so far I only know Ahoj! Jmenuji Vitez Alkalie. Čau! I'm already used to the fact that unpaid employees in the team leave after 7 days. I listen to mashups and YouTube videos instead of music. My dream is to learn how to play the piano and guitar so I can stop paying composers to create music for my games. I broke my macbook 2 months after purchase and have been working on this laptop through an external display since March 2021; someday I will definitely save up enough money to repair it to be able to go to Starbucks with it like a real programmer."
      }
    },
    "PORTFOLIO": {
      "COLUMNS": {
        "NAME": "Name",
        "DESCRIPTION": "Description (ru)",
        "TECHNOLOGIES": "Technologies",
        "DATES": {
          "DEVSTART": "Dev. started",
          "RELEASE": "Released",
          "ABANDON": "Abandoned"
        }
      },
      "SEARCH": {
        "PLACEHOLDER": "Search in portfolio: name, description, technologies",
        "EXAMPLE": "e.g. «API» or «Redux, React Native»",
        "CLEAR": "Clear"
      },
      "CATEGORIES": {
        "game/windows10": "Windows 10 video-game",
        "game/android": "Android video-game",
        "website": "Web-site",
        "bot/reddit": "Reddit bot",
        "figma_plugin": "Figma plugin",
        "bot/telegram": "Telegram bot",
        "npmjs_library": "JS library",
        "app": "App",
        "bot/vk": "VKontakte bot",
        "website/darknet": "Tor Hidden Services website",
        "bot/yandex_alice": "Alice bot",
        "chrome_extension": "Chrome extension",
        "stream": "Stream",
        "programming_language": "Programming language",
        "minecraft_map": "Minecraft map",
        "instagram_mask": "Instagram mask",
        "developer_tool": "Developer tool"
      },
      "FILTERS": {
        "ORDERS_ONLY": "Orders only",
        "PERSONAL_WEBSITES_ONLY": "My personal websites only",
        "RECENT_PROJECTS_ONLY": "Projects released in last 12 months only"
      },
      "HIDDEN_PROJECT": {
        "NAME": "Hidden project",
        "DESCRIPTION_PREVIEW": "Click to read more",
        "DESCRIPTION": "Information about this project is hidden, because its disclosure is against my principles about maintaining confidentiality and may discredit me. If you are interested in this project, I'm happy to tell you more personally, if you send me the number of this project: %PROJECT_ID%."
      },
      "SHOCK_PROJECT": {
        "NAME": "Shocking project",
        "DESCRIPTION_PREVIEW": "Click to reveal details",
        "DESCRIPTION": "The specified content may seem offensive and shocking to some people, however it is valueable enough, to leave it in my portfolio. If you want to see information about this project and other projects from the same category, please press the Show button below."
      },
      "PROJECT_DIALOG": {
        "LINKS_LABEL": "Links",
        "SHARE_LABEL": "Share",
        "CLOSE_LABEL": "Close",
        "LINK_COPIED": "Link was copied",
        "SHOW_SHOCKING_PROJECTS": "Show",
        "TRANSLATE_DESCRIPTION_LABEL": "Translate to English",
        "TRANSLATE_DESCRIPTION_CODE": "en"
      }
    },
    "ABOUT_THIS_WEBSITE": {
      "HEADING": "Website hloth.dev",
      "TEXT": "Это мой шестой по-счету персональный сайт. Он содержит информацию обо мне, моих проектах, является неким портфолио и резюме одновременно, и даже служит инструментом для пожертвований мне. Если вам все еще интересно, почему опубликовав игру в Steam и получая заказы со фриланса, я имею совесть просить донаты, то во-первых, я разработчик open-source приложений, инструментов для разработчиков и просто полезных программ, веселых сайтов (без рекламы!) и мобильных игр без доната, а во-вторых позвольте привести мне немного статистики по моей прибыли со всех моих продуктов (за исключением Stigfinnare, потому что это запрещено NDA от Steam Direct): ровно 0 долларов, что в рублях, в текущем курсе, 0 рублей. На моих сайтах нет рекламы, я не встраиваю платные подписки, деньги я получаю только с донатов друзей, привет Ваня Севрюков. С донатов за 2021 год я получил меньше 1000 рублей, а в случае Stigfinnare, так как я не могу разглашать никакую информацию о заработке, я просто оставлю намек: фактически нисколько, а если считать с затратами на разработку, то я ушел в минус на 20к. Немного информации о моих предыдущих сайтах:",
      "PREVIOUS_SITES": [
        "Сайт на конструкторе uCoz (2015-2016) — Мой первый сайт, на котором были игры, тесты и другие штучки, чем-то вдохновлён легендарным сайтом девочки Дианочки http://devo4ka-diano4ka.narod.ru/",
        "Сайт на hostinger (2018-2019) — Сайт на котором я учился на практике вебу: я создавал страницы, смотрел как работает html и даже смог установить свою первую капчу с проверкой",
        "Карта проектов (первая четверть 2020) — Сайт на котором была карта с проектами, всего было несколько пузырьков, а связь между ними обозначалась линиями, если навести курсор, то появлялось описание. Сделано на написанном мною движке на JavaScript",
        "Галерея проектов (вторая четверть 2020) — Сразу после того, как я выучил теорию по JS, я переделал свой сайт, он уже выглядел более современно, имел приятную палитру цветов, информацию обо мне и мое портфолио (только самые главные проекты), а также имел адекватную мобильную версию",
        "Лендинг с космическим дизайном (четвертая четверть 2020) — Сайт с анимациями, параллаксом, шейдером для градиентов в JavaScript и OpenGL, формой для связи, связанной с телеграм-ботом, который связан с SMTP-сервером для обратной связи. К сожалению, был закрыт через месяц из-за сложностей с созданием мобильной версии и лагами, потому что сайт был сделан на ванильном js, всего за пару месяцев до того, как я выучил React"
      ],
      "VISITORS_THIS_MONTH": "Visitors this month",
      "LINKS": {
        "INSTAGRAM_HIGHLIGHTS": "More screenshots in \"Highlights\"",
        "GITHUB_SOURCES": "Website sources on GitHub"
      }
    }
  }
}